ite-initial

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:calc="http://bull.com.pl/calc">
   <soapenv:Header/>
   <soapenv:Body>
      <calc:calculate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <TARIC_query xsi:type="xsd:string"><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="no"?>
			<TARIC_query xmlns="http://bull.com.pl/calc/calcxml" xmlns:xsp="http://apache.org/xsp" xmlns:input="http://apache.org/cocoon/xsp/input/1.0" xmlns:util="http://apache.org/xsp/util/2.0" xmlns:cinclude="http://apache.org/cocoon/include/1.0" xmlns:xsp-request="http://apache.org/xsp/request/2.0" id="SADSCREEN">
				<QINF>
					<transaction Id="T1">T1</transaction>
					<language Id="EN">EN</language>
					<currency Id="MKD">MKD</currency>
				</QINF>
				<SAD>
					<DTE>
						<dat_quest>2019-01-18</dat_quest>
					</DTE>
					<CUR>
						<currency>EUR</currency>
					</CUR>
					<ITEMS>
						<ITM id="1">
							<GDS nbr="8536909500"/>
							<GEO>
								<geo_area_id>GR</geo_area_id>
							</GEO>
							<CPC>
								<eu_proc_code>4000</eu_proc_code>
								<nat_proc_code>000</nat_proc_code>
							</CPC>
							<PRF>
								<pref_code>300</pref_code>
							</PRF>
							<WGT>
								<net_weight>130.47</net_weight>
								<gr_weight>130.47</gr_weight>
							</WGT>
							<VAL>
								<customs_value>105929.07</customs_value>
							</VAL>
							<ADD>
								<additional_expenses>0</additional_expenses>
							</ADD>
							<DOC>
								<doc_id>6007</doc_id>
							</DOC>
						</ITM>
					</ITEMS>
				</SAD>
				<OPTIONS>
					<forWeb>true</forWeb>
				</OPTIONS>
			</TARIC_query>
			]]></TARIC_query>
      </calc:calculate>
   </soapenv:Body>
</soapenv:Envelope>